{  
  "links": {
    "github": "https://github.com/gsalisi",
    "linkedin": "https://www.linkedin.com/in/geoffreysalisi",
    "resume": "http://geoffreysalisi.com/gsalisi_resume.pdf"
  }, 
  "works_and_skills": {
    "frontend": {
      "label": "Frontend Engineering",
      "description": "Years of experience in building user interfaces for web, mobile and native applications",
      "bullets": [
        "2+ years of hands-on experience in AngularJS 1.X-- proficiency in all its features and implementation",
        "Follows up-to-date best practices and developments in the HTML, CSS and JavaScript community",
        "Uses a wide array of front-end tools such as npm, grunt, gulp, browserify, babel, less etc.",
        "Takes great pride in creating beautiful and polished user interfaces that allows for a pleasurable user experience",
        "Used to develop Android applications and an IDE for SAP in Java"
        ]
    }, 
    "backend": {
      "label": "Backend Engineering",
      "description": "3 internships worth of full-stack application development experience",
      "bullets": [
        "Strong object-oriented programming understanding and other software design patterns",
        "Developed web application features that required changes on the frontend, API layer, service layer and database",
        "Used server-side technologies such as Flask, Spring MVC, Thrift and NodeJS",
        "Maintained a multi-platform low-level application that runs natively in Linux, Mac and Windows"
      ]
    }, 
    "core": {
      "label": "BS Computer Engineering",
      "description": "University of Waterloo, Expected Graduation May 2017",
      "bullets": [
        "Learned and implemented adaptive and cooperative algorithms such as PSO and ACO",
        "Gained fundamental distributed computing concepts and developed basic Hadoop and Spark projects",
        "Practical understanding of different search algorithms, data structures and their runtime/space complexities",
        "Understands lower level computing concepts such as OS, compilers, memory allocation, processes and threads",
        "Experenced with command line tools, linux bash environment and even circuits!"
        ]
    }, 
    "others": {
      "label": "Other software related interests",
      "description": "Some new/old things that I aspire to learn or use!",
      "bullets": [
        "Learn React framework to keep up with the new front-end trends", 
        "Try React Native; it looks promising with its goal to unify the frontend with none other than JavaScript",
        "Desire to try out mobile application development again, possibly IOS.",
        "Gain more experience with database technologies such as PostgreSQL and SQL"
      ]
    },  
    "dance": {
      "label": "Urban Hiphop Choreography",
      "description": "6 years of dancing to urban hiphop choreography competitively and as a hobby",
      "bullets": [
        "Competed for Bring your own Beat (BYOB 2014), Ontario University Competition for HipHop (OUCH 2012, 2013 and 2015)",
        "Co-directed OUCH competitive teams: Origins and Kindred Culture",
        "Teaches and dances with University of Waterloo Hiphop Club since 2012",
        "Joined University of the Philippines Los Banos Street Jazz Dance Company in 2010 to 2011",
        "Choreographed a set for the charity fashion show of Fashion for Change in 2014 and 2015"
      ],
      "link": {
        "label": "Oh really?",
        "href": "https://www.youtube.com/playlist?list=PLPoHClbCHMj2Yr9EEYynUsa9Z5AKb37M0"
      }
    }, 
    "work_delphix": {
      "label": "Frontend Engineering Intern",
      "description": "Delphix :: San Francisco, California :: September 2016 - December 2016",
      "bullets": [
        "Develops and maintains the user interface of the main Delphix Engine",
        "Uses AngularJS and Knockout.js as the main JavaScript frameworks/tool"
      ],
      "link": {
        "label": "More info",
        "href": "https://www.delphix.com"
      }
    }, 
    "work_compass": {
      "label": "Software Engineering Intern",
      "description": "Compass :: New York, New York :: January 2016 - July 2016",
      "bullets": [
        "Created an automated tour itinerary builder with optimized routes: Leveraged several Google APIs; cuts time to plan tour from hours to minutes",
        "Created an Angular static map service that wraps Google's directions service that creates a map with markers and polylines for directions",
        "Implemented the full-stack search functionality for our Documents center",
        "Modified Java Thrift server; Added MongoDB indexing; Created front-end search bar component",
        "Helped build a pdf export tool that renders HTML, converts it to PDF and downloads it"
      ],
      "link": {
        "label": "More info",
        "href": "https://www.compass.com"
      }
    }, 
    "work_sap": {
      "label": "Software Developer, In Memory",
      "description": "SAP Canada :: Waterloo, ON :: May 2015 - August 2015",
      "bullets": [
        "Worked on SAP Smart Data Streaming (SDS) Development Studio based on Eclipse Platform",
        "Integrated JUnit tests to the E2E test harness using bash script and Python",
        "Developed and tested software for Windows and Linux OS locally and on a VM remotely",
        "Maintained different parts of the stack such as the streaming server, SDK, compiler, etc."
      ],
      "link": {
        "label": "More info",
        "href": "http://help.sap.com/hana_options_sds/"
      }
    }, 
    "work_rbc": {
      "label": "Fullstack Software Developer",
      "description": "Royal Bank of Canada, Capital Markets :: Toronto, Ontario :: May 2015 - August 2015",
      "bullets": [
        "Built Market Risk web applications using Java Spring MVC, HTML, CSS and Javascript",
        "Created an Angular Boilerplate and security testing for as proof of concept",
        "Closely worked with a designer in building the user interface and enhance user experience"
      ], 
      "link": {
        "label": "More info",
        "href": "http://campus.rbccm.com/en/home/our-programs/risk-management/"
      }
    }, 
    "work_other": {
      "label": "Other work experience",
      "bullets": [
        "Technical Support Representative - University of Waterloo",
        "Desktop Support Technician - Ontario Hospital's Association",
        "General Labourer - Wing's Food Product",
        "Park Sweeper - Canada's Wonderland"
      ]
    }
  },
  "testimonials": [{
    "text": "Geoffrey is one of the top co-op students we've had. He has excelled in all categories and ultimately came to produce work of quality and quantity at the level of a full-time employee.  80% of my team are senior software developers and they all agree that Geoffrey is the best co-op they have worked with so far using metrics like work quality, ability to understand and communicate complex ideas, ability to think creatively around unique problems, and contributing significantly to our software ecosystem.There are also categories in which Geoffrey showed leadership relating to being sensitive to needs of others that wasn't obvious to the rest of us but was significant to those with the need.",
    "owner": "Login Jones, Architect @ RBC",
    "length": 10000
  },
  {
    "text": "Geoffrey has been an outstanding intern at Compass. He's not only working under the expectations I would have for a full time engineer, but also personally leading an important project for us to completion. Our CEO frequently comes, unprompted, to praise some of the work Geoffrey did, especially on the Toursheet project.",
    "owner": "Yunchi Luo, Engineering Manager @ Compass",
    "length": 7000
  },
  {
    "text": "Geoffrey is the biggest teddy bear you'll ever meet. He's so fluffy and huggable.",
    "owner": "Janice Lee, BSc Biomedical Science Graduate, University of Waterloo",
    "length": 3000
  }],
  "test": "test123"
}
